БухЭксп/Reports/CW_АнализПрибылиПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_АнализПрибылиПоГрузоперевозкам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийВызов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВнешнихНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЗакрытиеФинансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗакрытиеФинансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/CW_АнализПрибылиПоГрузоперевозкам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	Если Настройки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	// --- 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	мПоляКУдалению = Новый Массив;
	Для Индекс = 0 по  НастройкиСКД.Выбор.Элементы.Количество() - 1 Цикл
		Поле = НастройкиСКД.Выбор.Элементы[Индекс];
		Если не ТипЗнч(Поле)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			мПоляКУдалению.Добавить(Поле);
		КонецЕсли;
	КонецЦикла;
	
	Если мПоляКУдалению.Количество() > 0 Тогда
		Для Каждого ЭлементМассива из мПоляКУдалению Цикл
			НастройкиСКД.Выбор.Элементы.Удалить(ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	
	// ---
	НастройкиСКД.Структура.Очистить();

	//Параметры вывода
	СтркутураПараметров = Новый Структура;
	СтркутураПараметров.Вставить("Заголовок"					, ВРег(МетаданныеОтчета.Синоним));
	СтркутураПараметров.Вставить("РасположениеРеквизитов"		, ?(Настройки.ОбъединитьГруппировки,РасположениеРеквизитовКомпоновкиДанных.Отдельно			, РасположениеРеквизитовКомпоновкиДанных.ВСпециальнойПозиции));
	СтркутураПараметров.Вставить("РасположениеГруппировки"		, ?(Настройки.ОбъединитьГруппировки,РасположениеГруппировкиКомпоновкиДанных.Конец			, Неопределено));
	СтркутураПараметров.Вставить("РасположениеПолейГруппировки"	, ?(Настройки.ОбъединитьГруппировки,РасположениеПолейГруппировкиКомпоновкиДанных.Отдельно	, Неопределено));
	СтркутураПараметров.Вставить("ТипЗаголовкаПолей"			, ?(Настройки.ОбъединитьГруппировки,ТипЗаголовкаПолейКомпоновкиДанных.Краткий				, Неопределено));
	
	CW_Отчеты.УстановитьПараметрыВыводаКомпоновкиДанных(НастройкиСКД, СтркутураПараметров);
	// Установим параметры
	//НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Настройки["Период"]);
	Если (Настройки.Данные = 0) Тогда
		МассивГрузоперевозок = ПолучитьМассивГрузоперевозок(Настройки);
		ЗначениеПараметра = ПредставлениеПериода(Настройки.НачалоПериода,КонецДня(Настройки.КонецПериода));
	Иначе
		МассивГрузоперевозок = Настройки.Грузоперевозки.ВыгрузитьЗначения();
		ЗначениеПараметра = _сф.м_Представление(МассивГрузоперевозок,";");
	КонецЕсли; 
	
	ЕстьСписокГрузоперевозокПоПутевымЛистам = Ложь;
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта") Тогда
		ЕстьСписокГрузоперевозокПоПутевымЛистам = истина;
	КонецЕсли;
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("Грузоперевозки"							, ЗначениеПараметра								, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ЕстьСписокГрузоперевозокПоПутевымЛистам"	, ЕстьСписокГрузоперевозокПоПутевымЛистам		, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("СписокГрузоперевозок"	, МассивГрузоперевозок			, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВерсияБюджета"			, ?(Настройки["ВерсияБюджета"].Пустая(),Справочники.CW_ВерсииБюджетов.Основная,Настройки["ВерсияБюджета"]) , НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("Организация"			, Неопределено					, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПоАктам"				, Настройки.ВариантФормирования = 0, НастройкиСКД.ПараметрыДанных);

	// --- 
	Если (Настройки.ПорядокОтражения = 0) Тогда
		
		ПорядокОтраженияРасходов = Новый Массив; 
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
		
		ПорядокОтраженияДоходов = Новый Массив; 
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"));
		
	ИначеЕсли (Настройки.ПорядокОтражения = 1) Тогда 
		
		ПорядокОтраженияРасходов = Новый Массив; 
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы"));
		
		ПорядокОтраженияДоходов = Новый Массив; 
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
		
	ИначеЕсли (Настройки.ПорядокОтражения = 2) Тогда 
		
		ПорядокОтраженияРасходов = Новый Массив; 
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
		
		ПорядокОтраженияДоходов = Новый Массив; 
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"));
	
	КонецЕсли; 
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПорядокОтраженияРасходов"			, ПорядокОтраженияРасходов 					, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПорядокОтраженияДоходов"			, ПорядокОтраженияДоходов 					, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПолучитьРасходыПоПутевымЛистам"	, Настройки.ПолучитьРасходыПоПутевымЛистам 	, НастройкиСКД.ПараметрыДанных);

	Если (Настройки.ИсключатьВнутрихолдинговыеВзаиморасчеты) Тогда
		ЗначениеПараметра = CW_Финансы.ПолучитьКонтрагентовХолдинга();	
	Иначе
		ЗначениеПараметра = Новый Массив;
	КонецЕсли; 
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонтрагентыХолдинга", ЗначениеПараметра, НастройкиСКД.ПараметрыДанных);

	СоответствиеСтатистика = Новый Соответствие;
	СоответствиеСтатистика.Вставить("СредняяПрибыль",		Настройки.ВыводитьСтатистику);
	СоответствиеСтатистика.Вставить("СредняяПрибыльПлан", 	Настройки.ВыводитьСтатистикуПлан);
	
	//----
	//Выбранные поля
	// обрабатываем разделы и показатели
	Для каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		Если ТипЗнч(Поле)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			// план-факт-отклонение
			Элемент = Настройки.Разделы.НайтиПоЗначению(Строка(Поле.Поле));
			Если Элемент = Неопределено Тогда
				Если (Поле.Заголовок = "Статистика") Тогда
					Поле.Использование = Настройки.ВыводитьСтатистику или Настройки.ВыводитьСтатистикуПлан;
					// --- 
					// проходим по подчинённым элементам "расходы-доходы-прибыль"
					Для каждого ПодРаздел Из Поле.Элементы Цикл
						Если (Строка(ПодРаздел.Поле) = "Количество") Тогда
							ПодРаздел.Использование = Истина;
							Продолжить;
						КонецЕсли; 
						Если (Строка(ПодРаздел.Поле) = "СредняяПрибыль") Тогда
							Для каждого ПолеСреднейПрибыли Из ПодРаздел.Элементы Цикл
								ИмяПоля = СтрЗаменить(Строка(ПолеСреднейПрибыли.Поле),"СредняяПрибыль","");
								ПолеСреднейПрибыли.Использование = Настройки.Показатели.НайтиПоЗначению(ИмяПоля).Пометка и Настройки.ВыводитьСтатистику;		
							КонецЦикла; 
						КонецЕсли;  
						Если (Строка(ПодРаздел.Поле) = "СредняяПрибыльПлан") Тогда
							Для каждого ПолеСреднейПрибыли Из ПодРаздел.Элементы Цикл
								ИмяПоля = СтрЗаменить(Строка(ПолеСреднейПрибыли.Поле),"СредняяПрибыльПлан","");
								ПолеСреднейПрибыли.Использование = Настройки.Показатели.НайтиПоЗначению(ИмяПоля).Пометка и Настройки.ВыводитьСтатистикуПлан;		
							КонецЦикла; 
						КонецЕсли;  
					КонецЦикла;
				Иначе
					Поле.Использование = Ложь;
				КонецЕсли; 
			Иначе
				Поле.Использование = Элемент.Пометка;
			КонецЕсли;  
			
			
			Если Поле.Использование Тогда
				// проходим по подчинённым элементам "расходы-доходы-прибыль"
				Для каждого ПодРаздел Из Поле.Элементы Цикл
					Если ТипЗнч(ПодРаздел)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
						ИмяПодраздела = СтрЗаменить(Строка(Подраздел.Поле),Строка(Поле.Поле)+".","");
						Если ИмяПодраздела = "Расходы" ИЛИ ИмяПодраздела = "Доходы" Тогда
							ПодРаздел.Использование = Настройки.ВыводитьРасходыДоходы;
						КонецЕсли; 
						Если ПодРаздел.Использование Тогда
							// проходим по подчинённым элементам
							Для каждого Показатель Из ПодРаздел.Элементы Цикл
								Если ПодРаздел.Заголовок = "СредняяПрибыль" Тогда 
									ИмяПоля = СтрЗаменить(Строка(Показатель.Поле),"СредняяПрибыль","");  
									ИспользованиеСтатистики = СоответствиеСтатистика.Получить("СредняяПрибыль");
								ИначеЕсли ПодРаздел.Заголовок = "СредняяПрибыльПлан" Тогда
									ИмяПоля = СтрЗаменить(Строка(Показатель.Поле),"СредняяПрибыльПлан","");   
									ИспользованиеСтатистики = СоответствиеСтатистика.Получить("СредняяПрибыльПлан");
								Иначе
									ИмяПоля = СтрЗаменить(Строка(Показатель.Поле),Строка(Поле.Поле)+"."+ИмяПодраздела+"."+Строка(Поле.Поле)+ИмяПодраздела,"");
									ИспользованиеСтатистики = Истина;
								КонецЕсли; 
								Показатель.Использование = Настройки.Показатели.НайтиПоЗначению(ИмяПоля).Пометка и ИспользованиеСтатистики;
							КонецЦикла;
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		Иначе
			НастройкиСКД.Выбор.Элементы.Удалить(Поле);
		КонецЕсли; 
	КонецЦикла; 
	
	//AFR-250367 от 29.08.2025 12:27:07
	//Индекс = 0;
	//Для каждого Поле Из Настройки.Группировки Цикл
	//	
	//	ПолеВыбора = НастройкиСКД.Выбор.Элементы.Вставить(Индекс, Тип("ВыбранноеПолеКомпоновкиДанных"));
	//	
	//	Если ПолеВыбора <> Неопределено Тогда
	//		ПолеВыбора.Поле		 		= Новый ПолеКомпоновкиДанных(Поле.ИмяПоля);
	//		ПолеВыбора.Использование 	= Истина;
	//		Индекс = Индекс + 1;
	//	КонецЕсли;
	//	
	//КонецЦикла;
 	//AFR-250367 от 29.08.2025 12:27:07


	//----
	// формируем структуру отчета по группировкам
	CW_Отчеты.УстановитьГруппировкиОтчетаКомпановкиДанных(НастройкиСКД.Структура, Настройки.Группировки, Настройки.ОбъединитьГруппировки);
	
	// ---------------------------------------------------------------------------- 
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());   
	Если ГруппаПользователя.ФильтрГрузоперевозок 
		ИЛИ ГруппаПользователя.ФильтрЗаказов Тогда
		КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	КонецЕсли;	
	
	Если ГруппаПользователя.ФильтрГрузоперевозок Тогда
		ФильтрГрузоперевозок = ГруппаПользователя.ХранилищеФильтраГрузоперевозок.Получить(); 
		CW_Отчеты.СкопироватьОтбор(ФильтрГрузоперевозок.Отбор, КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Грузоперевозка");
	КонецЕсли;
	
	//Если ГруппаПользователя.ФильтрЗаказов Тогда
	//	ФильтрЗаказов = ГруппаПользователя.ХранилищеФильтраЗаказов.Получить(); 
	//	КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	//	CW_Отчеты.СкопироватьОтбор(ФильтрГрузоперевозок.Отбор, КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Заказ");
	//КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьМассивГрузоперевозок(Настройки)
	
	ПолеДляОтбора		= Настройки.ДатаОпределенияПрибыли;
	ПолучаемоеЗначение	= Настройки.ПолучаемоеЗначение;

	НачПериода 			= НачалоДня(Настройки.НачалоПериода);
	КонПериода 			= КонецДня(Настройки.КонецПериода);
	
	Если ПолеДляОтбора = "Реквизит.ДатаЗакрытия" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ЗакрытиеФинансов.Аналитика КАК Аналитика
		               |ПОМЕСТИТЬ ВТ_ВременнаяТаблица
		               |ИЗ
		               |	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
		               |ГДЕ
		               |	CW_ЗакрытиеФинансов.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВременнаяТаблица.Аналитика КАК Аналитика
		               |ПОМЕСТИТЬ ВТ_Грузоперевозки
		               |ИЗ
		               |	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
		               |ГДЕ
		               |	ВТ_ВременнаяТаблица.Аналитика ССЫЛКА Справочник.CW_Грузоперевозки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВременнаяТаблица.Аналитика КАК Аналитика
		               |ПОМЕСТИТЬ ВТ_Заказы
		               |ИЗ
		               |	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
		               |ГДЕ
		               |	ВТ_ВременнаяТаблица.Аналитика ССЫЛКА Справочник.CW_Заказы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	CW_Грузоперевозки.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_ГрузоперевозкиЗаказа
		               |ИЗ
		               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		               |ГДЕ
		               |	CW_Грузоперевозки.Заказ В
		               |			(ВЫБРАТЬ
		               |				ВТ_Заказы.Аналитика КАК Аналитика
		               |			ИЗ
		               |				ВТ_Заказы КАК ВТ_Заказы)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Грузоперевозки.Аналитика КАК Грузоперевозка
		               |ПОМЕСТИТЬ ВТ_ВсеГрузоперевозки
		               |ИЗ
		               |	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_ГрузоперевозкиЗаказа.Ссылка 
		               |ИЗ
		               |	ВТ_ГрузоперевозкиЗаказа КАК ВТ_ГрузоперевозкиЗаказа
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ_ВсеГрузоперевозки.Грузоперевозка КАК Ссылка
		               |ИЗ
		               |	ВТ_ВсеГрузоперевозки КАК ВТ_ВсеГрузоперевозки";
		
		Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НачПериода));
		Запрос.УстановитьПараметр("КонецПериода", 	КонецДня(КонПериода));   
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		
	ИначеЕсли Найти(ПолеДляОтбора,"Реквизит.") <> 0 И ПолеДляОтбора <> "Реквизит.ДатаЗакрытия" Тогда
		
		ПолеДляОтбора = СтрЗаменить(ПолеДляОтбора,"Реквизит.","");
		
		Запрос = Новый Запрос;    
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_Грузоперевозки.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		               |ГДЕ
		               |	CW_Грузоперевозки.ДатаСделкиФ МЕЖДУ &НачалоПериода И &КонецПериода";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДатаСделкиФ", ПолеДляОтбора);
		
		Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НачПериода));
		Запрос.УстановитьПараметр("КонецПериода",  	КонецДня(КонПериода));
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		Параметр = XMLЗначение(Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"), ПолеДляОтбора);
		
		Если Настройки.Свойство("ОбъектыПараметра") 
			И ТипЗнч(Настройки.ОбъектыПараметра) = Тип("Массив") Тогда 
			
			МассивГрузоперевозок = Новый Массив; 
			Если Настройки.ОбъектыПараметра.Количество() = 0 Тогда
				МассивГрузоперевозок = МассивПоПараметруГрузоперевозок(Параметр, ПолучаемоеЗначение, НачПериода, КонПериода);
			КонецЕсли;
			
			Для Каждого ОбъектПараметра из Настройки.ОбъектыПараметра Цикл
				Если ОбъектПараметра = "Грузоперевозка" тогда
					Массив = МассивПоПараметруГрузоперевозок(Параметр, ПолучаемоеЗначение, НачПериода, КонПериода);
				КонецЕсли;
				Если ОбъектПараметра = "Заказ" тогда
					Массив = МассивПоПараметруЗаказов(Параметр, ПолучаемоеЗначение, НачПериода, КонПериода);
				КонецЕсли;
				Если ОбъектПараметра = "Заявка" тогда
					Массив = МассивПоПараметруЗаявок(Параметр, ПолучаемоеЗначение, НачПериода, КонПериода);
				КонецЕсли;    
				
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивГрузоперевозок, Массив, Истина);
			КонецЦикла;
		Иначе
			МассивГрузоперевозок = МассивПоПараметруГрузоперевозок(Параметр, ПолучаемоеЗначение, НачПериода, КонПериода);
		КонецЕсли;  
		
		Возврат МассивГрузоперевозок;
		
	КонецЕсли;
	
КонецФункции 

Функция МассивПоПараметруЗаказов(Знач Параметр, Знач ПолучаемоеЗначение, Знач НачПериода, Знач КонПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	CW_ХарактеристикиЗаказов.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	|ГДЕ
	|	CW_ХарактеристикиЗаказов.Параметр = &Параметр  
	|	И CW_ХарактеристикиЗаказов.Значение МЕЖДУ &НачалоПериода И &КонецПериода";   
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Значение", ПолучаемоеЗначение);	
	
	Запрос.УстановитьПараметр("Параметр", 		Параметр);
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонецПериода",  	КонецДня(КонПериода));
	
	Заказы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	
	Возврат Справочники.CW_Заказы.ПолучитьМассивГрузоперевозокЗаказа(Заказы);

КонецФункции 

Функция МассивПоПараметруЗаявок(Знач Параметр, Знач ПолучаемоеЗначение, Знач НачПериода, Знач КонПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ХарактеристикиЗаявок.Заявка КАК Заявка
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиЗаявок КАК CW_ХарактеристикиЗаявок
	|ГДЕ
	|	CW_ХарактеристикиЗаявок.Параметр = &Параметр  
	|	И CW_ХарактеристикиЗаявок.Значение МЕЖДУ &НачалоПериода И &КонецПериода";   
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Значение", ПолучаемоеЗначение);	
	
	Запрос.УстановитьПараметр("Параметр", 		Параметр);
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонецПериода",  	КонецДня(КонПериода));
	
	Заявки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заявка");
	
	Возврат Справочники.CW_Заявки.ПолучитьМассивГрузоперевозокЗаявки(Заявки);

КонецФункции 

Функция МассивПоПараметруГрузоперевозок(Знач Параметр, Знач ПолучаемоеЗначение, Знач НачПериода, Знач КонПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Ссылка
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	|ГДЕ
	|	CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр  
	|	И CW_ХарактеристикиГрузоперевозок.Значение МЕЖДУ &НачалоПериода И &КонецПериода";   
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Значение", ПолучаемоеЗначение);	
	
	Запрос.УстановитьПараметр("Параметр", 		Параметр);
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонецПериода",  	КонецДня(КонПериода));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции 


#КонецЕсли
